// ----------------------------------------------
// Нормалізація стилів (declarations.d.ts) /
// Типізація нестандартних модулів
// ----------------------------------------------
// При імпорті modern-normalize, ви імпортуєте CSS-файл напряму. TypeScript не знає, що таке "modern-normalize", бо це не TypeScript-модуль. Якщо типи не встановлено  з'явиться помилка (підкреслення).
// Щоб виправити це, створіть файл src/declarations.d.ts. У ньому можна вручну оголосити модулі, які не мають типів
// declare module  це інструкція для TS: "так, цей модуль є, але типів для нього немає  прийми його як є". Після цього TypeScript перестане показувати помилку  він "вірить", що такий модуль існує.
// ----------------------------------------------

declare module "modern-normalize";
